;
; If you have translated the new language file, you can send it to aqiayi@sina.com .
; welcome to visit Baymax Patch toOls website: https://www.chinapyg.com

[Info]
;Language name in your own language e.g. Deutsch
LanguageVer = 1.0
Language = 简体中文
CountriesOrRegions = 中国
LangId = 0804
Translator = Baymax

;Note to translators:
;Please keep escape sequences like $1, $2, \n, \t, %d, %s, %% unchanged
[BaymaxUi]
; Main UI
1000 = 信息
1001 = 目标程序：
1002 = 补丁标题：
1003 = 作者信息：
1004 = 数据
1005 = 补丁类型：
1006 = 添加补丁
1007 = 查看该项
1008 = 删除该项
1009 = 序号
1010 = 补丁类型
1011 = 模块名称
1012 = 补丁数据
1013 = 创建补丁

; Menu
1100 = 工程(&P)
1101 = 工具(&T)
1102 = 设置(&O)
1103 = 帮助(&H)

; Sub0 Menu
1110 = 新建工程(&N)
1111 = 加载补丁工程(&L)
1112 = 保存补丁工程(&S)
1113 = 创建劫持补丁(&U)
1114 = 创建注入补丁(&I)
1115 = 创建劫持调试补丁(&D)
1116 = 创建注入调试补丁(&P)
1117 = 退出(&X)

; Sub2 Menu
1130 = 保护硬件断点(&P)
1131 = OEP不设置中断(&O)
1132 = 补丁含有无效条目(&U)
1133 = 无效条目最多搜索5次(&F)
1134 = 自定义补丁DLL时机(&M)
1135 = 软件断点中断模式(&I)
1136 = 模拟单步模式（单线程）
1137 = 模拟单步模式II（单线程）
1138 = 模仿HOOK模式（支持多线程）
1139 = 硬件断点中断模式(&B)
1140 = 设置在当前线程（其他线程不设置，HOOK线程调用的API后方可设置断点）
1141 = 设置在所有线程（默认通过API HOOK对所有线程设置硬断）
1142 = Loader 加载模式(&L)
1143 = APC 主线程注入（before Oep）
1144 = 自主加载（When Running to Oep）
1145 = 补丁启动不弹窗(&S)
1146 = 切换语言

; Sub3 Menu
1150 = 帮助文档(&H)
1151 = 查看更新(&U) 
1152 = 送颗星星吧(&S)
1153 = 关于(&A)

; Popup Menu
1160 = 查看该项
1161 = 删除该项

; TEXT
1200 = Baymax64 友情提示
1201 = 和谐补丁64.exe
1202 = 和谐补丁调试版64.exe
1203 = 注入补丁64.exe
1204 = 注入补丁调试版64.exe
1205 = Baymax 友情提示
1206 = 和谐补丁.exe
1207 = 和谐补丁调试版.exe
1208 = 注入补丁.exe
1209 = 注入补丁调试版.exe

1210 = 加载补丁工程失败！若补丁工程为高版本请使用最新版加载。
1211 = 未发现补丁数据！
1212 = EXE文件(*.exe)\0*.exe\0
1213 = 新建工程
1214 = 是否需要保存当前工程？
1215 = 退出前是否需要保存补丁工程？
1216 = Baymax 免责声明
1217 = 本工具仅供技术交流，请勿用于商业或非法用途！\r\n您创建的补丁文件造成的一切影响和本作者无关！\r\n\r\n    当您点击确定后代表您已经同意本条款。
1218 = 本程序补丁仅供技术学习研究，\r\n请在下载后24小时内自行删除！\r\n如果您喜欢该程序请注册购买。
1219 = 帮助文档不存在，请从官方下载最新版。
1220 = 打开帮助文档失败，请从程序目录打开“Help.pdf”文件。
1221 = 添加补丁
1222 = 创建补丁
1223 = 请先设置目标程序！
1224 = 补丁文件创建成功！
1225 = 补丁文件创建失败！
1226 = 程序已损坏，请从官方下载最新版本！
1227 = 该条目中包含存储数据且被其他条目引用，请先解除引用后再进行删除。
1228 = EXE文件(*.exe)\0
1229 = BPT文件(*.bpt)\0*.bpt\0
1230 = BPT文件(*.bpt)\0
1231 = 该项目中已包含 %d 条补丁条目，是否需要重新设置目标程序？
1232 = 加载新工程前，是否需要保存当前工程？
1233 = 确定要删除该补丁条目吗？

[FeatureCodeUi]
; PlugIn Name
666 = 搜索替换补丁

; Main UI
1000 = 搜索替换补丁
1001 = 文件
1002 = 进程：
1003 = 模块：
1004 = 目标为任意进程
1005 = 目标为其他模块
1006 = 解码后补丁
1007 = 补丁数据需程序解码后进行判定
1008 = 设置
1009 = 补丁地址
1010 = 虚拟地址(VA):
1011 = 模块基址：
1012 = 比较文件
1013 = 特征码搜索：   ( 请在原始数据栏填写特征码数据, 支持'??'模糊匹配 )
1014 = 特征码搜索
1015 = 导出函数：
1016 = 补丁数据
1017 = 原始数据：
1018 = 补丁数据：
1019 = 注释说明：
1020 = 删除
1021 = 修改
1022 = 添加
1023 = 取消
1024 = 保存
1025 = 偏移地址(RVA)
1026 = 原始数据
1027 = 补丁数据
1028 = 注释说明

;HookUi
1100 = 执行补丁时机
1101 = 不需要处理
1102 = HOOK API方式
1103 = 选择模块：
1104 = 导出函数：
1105 = 设置中断方式
1106 = 模块名称：
1107 = 中断地址(RVA)：
1108 = 动态地址方式
1109 = 包含补丁数据所申请空间的最小值(HEX)：
1110 = 等待时间方式
1111 = 等待毫秒(DEC)：
1112 = HOOK选项
1113 = 确定
1114 = 取消

;HookUi Text
1150 = HOOK设置
1151 = HOOK设置有误
1152 = 模块设置有误
1153 = API设置有误
1154 = RVA数值设置有误，请重新输入十六进制数值。
1155 = 空间最小值设置有误，请重新输入十六进制数值。
1156 = 等待毫秒数设置有误，请重新输入十进制数值。
1157 = EXE文件(*.exe)\0*.exe\0DLL文件(*.dll)\0*.dll\0PE文件(*.*)\0*.*\0

;FixItem Ui
1200 = 编辑补丁条目

;Msg Text
1300 = HOOK设置
1301 = 补丁数据未添加
1302 = 数据添加有误
1303 = 原始数据栏输入有误
1304 = 补丁数据栏输入有误
1305 = 补丁地址输入有误

1310 = 确定要取消HOOK选项么？
1311 = 还有补丁数据未保存，是否直接关闭补丁窗口？
1312 = 您输入的数据有误，请核实后再进行操作。
1313 = 补丁地址有误！RVA相对偏移地址数据输入有误。
1314 = 补丁地址有误！虚拟地址(VA)不能为空，请输入补丁地址（十六进制）。
1315 = 补丁地址有误！模块基址不能为空，请输入模块在内存中加载的地址（十六进制）。
1316 = 补丁地址有误！虚拟地址数据有误，请输入十六进制数据。
1317 = 补丁地址有误！模块基址数据有误，请输入十六进制数据。
1318 = 补丁地址有误！虚拟地址(VA)不得小于等于模块基地址，且不能小于等于零。
1319 = 输入的数据需为十六进制(HEX)数值(通配符请使用英文字符 ?? )。
1320 = 输入的十六进制数据字符长度应为偶数。
1321 = 原始数据不能为空。
1322 = 补丁数据不能为空。
1323 = 原始数据格式有误，应为十六进制(HEX)数值。
1324 = 补丁数据格式有误，应为十六进制(HEX)数值。
1325 = 原始数据和补丁数据长度不一致。
1326 = 原始数据有误：输入的数据需为十六进制(HEX)数值(通配符请使用英文字符 ?? )。
1327 = 补丁数据有误：输入的数据需为十六进制(HEX)数值(通配符请使用英文字符 ?? )。
1328 = 功能模块加载失败！
1329 = 获取补丁数据失败！
1330 = 原始数据和补丁数据相同，请检查后再进行添加。

1350 = 未勾选”目标为其他模块“!  
1351 = EXE文件(*.exe)\0*.exe\0
1352 = DLL文件(*.*)\0*.*\0

; PE Check
2000 = 文件不存在或加载失败
2001 = 这不是一个有效的PE文件
2002 = 这不是一个有效的32bit PE文件
2003 = 这不是一个有效的32bit Dll文件
2004 = 这不是一个有效的32bit EXE文件
2005 = 这不是一个有效的64bit PE文件
2006 = 这不是一个有效的64bit Dll文件
2007 = 这不是一个有效的64bit EXE文件


[BreakPointCodeUi]
; PlugIn Name
666 = 异常中断补丁

; Main UI
1000 = 异常中断补丁
1001 = 文件
1002 = 进程：
1003 = 模块：
1004 = 目标为任意进程
1005 = 目标为其他模块
1006 = 解码后补丁
1007 = 补丁数据需程序解码后进行判定
1008 = 设置

1009 = 中断地址
1010 = 虚拟地址(VA):
1011 = 模块基址：
1012 = 首字节
1013 = 特征码寻址：
1014 = 特征码搜索
1015 = 偏移值：
1016 = 导出函数：
1017 = 偏移值：
1018 = 修改返回值
1019 = 返回地址栈偏移：
1020 = 栈调整：

1021 = 补丁数据
1022 = 补丁类型：
1023 = 标志寄存器：
1024 = 寄存器：
1025 = 偏移：
1026 = 修改值为：
1027 = 值类型：
1028 = 寄存器：
1029 = 偏移：
1030 = 数据运算
1031 = 补丁数据从文本读取的标号

1032 = 补丁数据：
1033 = 注释说明：
1034 = 频率：
1035 = 类型：
1036 = 条件断点
1037 = 删除
1038 = 修改
1039 = 添加
1040 = 取消
1041 = 保存
1042 = 注：输入数据均为十六进制

1043 = 偏移地址(RVA)
1044 = 原始数据
1045 = 补丁数据
1046 = 注释说明

;HookUi
1100 = 执行补丁时机
1101 = 不需要处理
1102 = HOOK API方式
1103 = 选择模块：
1104 = 导出函数：
1105 = 设置中断方式
1106 = 模块名称：
1107 = 中断地址(RVA)：
1108 = 动态地址方式
1109 = 包含补丁数据所申请空间的最小值(HEX)：
1110 = 等待时间方式
1111 = 等待毫秒(DEC)：
1112 = HOOK选项
1113 = 确定
1114 = 取消

;HookUi Text
1150 = HOOK设置
1151 = HOOK设置有误
1152 = 模块设置有误
1153 = API设置有误
1154 = RVA数值设置有误，请重新输入十六进制数值。
1155 = 空间最小值设置有误，请重新输入十六进制数值。
1156 = 等待毫秒数设置有误，请重新输入十进制数值。
1157 = EXE文件(*.exe)\0*.exe\0DLL文件(*.dll)\0*.dll\0PE文件(*.*)\0*.*\0

; FixItemDlg UI
1200 = 编辑补丁条目
1201 = 取消
1202 = 保存

1210 = 补丁数据：
1211 = EIP 偏移：
1212 = RIP 偏移：
1213 = HEX 长度：
1214 = 存储标号：
1215 = 寄存器值：
1216 = 补丁说明：
1217 = 标号数据：
1218 = 超时检测：
1219 = 修改值为：
1220 = 存储值为：
1221 = 您捕获的数据为：

; FixItem MsgText

;MemOffsetDlg Ui
1300 = 目标地址(偏移均为HEX)
1301 = 寻址寄存器：
1302 = 寄存器指向的内存：
1303 = 样例：[ESP+24]+3C。当寻址寄存器为EXX/RXX，则代指所存储地址
1304 = 转化
1305 = 确定

1310 = 格式解析
1311 = 数据有误，未找到寄存器。
1312 = 数据有误，寄存器类型不符。
1313 = 数据有误，偏移值填写有误。
1314 = 数据有误，[]符号不匹配。
1315 = 数据有误，字符串解析有剩余。
1316 = 数据有误，解析错误请检查。
1317 = 数据有误，匹配左值有误。
1318 = 数据有误，偏移值缺少符号。

;ConditionDlg Ui
1400 = 条件断点
1401 = 频率：
1402 = 条件设置
1403 = 不使用条件断点
1404 = 第几次执行中断：
1405 = 中断类型：
1406 = 寄存器：
1407 = 偏移：
1408 = 数据类型：
1409 = 条件：
1410 = 数值：
1411 = 自定义条件断点：
1412 = 取消
1413 = 确定

; MsgText
1500 = 请设置中断类型
1501 = 请设置寄存器类型
1502 = 请设置数据类型
1503 = 请设置条件类型
1504 = 偏移栏输入数值有误，请核对修改。
1505 = 数值栏输入数据有误，请核对修改。

1510 = HOOK设置
1511 = 补丁数据未添加
1512 = 数据添加有误
1513 = 特征码数据栏输入有误
1514 = 补丁数据栏输入有误
1515 = RVA地址输入有误
1516 = 友情提示
1517 = 编辑补丁条目

1520 = 确定要取消HOOK选项么？
1521 = 还有补丁数据未保存，是否直接关闭补丁窗口？
1522 = 您输入的数据有误，请核实后再进行操作。
1523 = 补丁地址有误！RVA相对偏移地址数据输入有误。
1524 = 补丁地址有误！虚拟地址(VA)不能为空，请输入补丁地址（十六进制）。
1525 = 补丁地址有误！模块基址不能为空，请输入模块在内存中加载的地址（十六进制）。
1526 = 补丁地址有误！虚拟地址数据有误，请输入十六进制数据。
1527 = 补丁地址有误！模块基址数据有误，请输入十六进制数据。
1528 = 补丁地址有误！虚拟地址(VA)不得小于等于模块基地址，且不能小于等于零。
1529 = 输入的数据需为十六进制(HEX)数值(通配符请使用英文字符 ?? )。
1530 = 输入的十六进制数据字符长度应为偶数。
1531 = 原始数据或补丁数据不能为空。
1532 = 原始数据格式有误，应为十六进制(HEX)数值。
1533 = 补丁数据格式有误，应为十六进制(HEX)数值。
1534 = 原始数据和补丁数据长度不一致。
1535 = 特征码数据的偏移值错误，应为HEX数值。
1536 = 补丁地址首字节数据有误，请填写该字节HEX数值，若目标模块未加壳请填写0。
1537 = 目标模块疑似被加壳或该RVA指向的数据有待解码，需要填写该补丁地址首字节数据。
1538 = 目标模块RVA数值和输入的首字节值不同，模块疑似加壳或运行后需解码，请悉知。
1539 = 补丁数据项设置有误。
1540 = 补丁数据输入有误。
1541 = 函数偏移值输入有误。
1542 = 函数返回地址的栈偏移数值有误，应为DWORD或QWORD字节对齐。
1543 = Ini文件中Keyword不能为空，最小长度一个字符。
1544 = 补丁地址有误！特征码寻址格式为：AA BB ??
1545 = 函数返回地址的栈调整数值有误，应为DWORD或QWORD字节对齐。
1546 = 请先选择对应的寄存器。
1547 = 未找到补丁数据对应的该数据类型的存储标号，请先存储该标号后再进行使用。
1548 = 当前存储标号已被使用，请更换为其他存储标号。
1549 = 标志寄存器为空，请先选择对应的寄存器。
1550 = 寄存器为空，请先选择对应的寄存器。
1551 = 修改值类型为空，请先选择对应的修改值类型。
1552 = 值类型为空，请先选择对应的值类型。
1553 = 寄存器值输入有误。
1554 = 寄存器偏移设置有误。
1555 = EIP/RIP 偏移值设置有误。
1556 = HEX 长度有误，请输入补丁数据的HEX长度（长度为十六进制）。
1557 = 存储标号有误，标号字符仅允许字母、数字和下划线。
1558 = 补丁数据从文本读取的标号有误，标号字符仅允许字母、数字和下划线。
1559 = 功能模块加载失败！
1560 = 该条目中包含存储标号 %s，是否要删除？
1561 = 您已删除了包含存储标号 %s 的条目，若该标号在其他地方有使用，请进行修改。
1562 = 存储标号有误，存储标号非地址类型或不存在！
1563 = 补丁条目中包含存储变量，且被其他条目所使用，请先解除使用后再进行修改。
1564 = 当 EIP/RIP 偏移值填写NOP（或0）时，补丁模块将自动获取中断地址的汇编指令长度并增加 EIP/RIP，实现跳过该指令效果。\r\n偏移值非NOP（或0）时，EIP/RIP 偏移值计算方法为目标地址减去当前地址（请输入十六进程数值）。
1565 = 修改 EIP/RIP 说明
1566 = 不再提示
1567 = 确定

1570 = 解析补丁条目失败！
1571 = 未勾选”目标为其他模块“!  
1572 = 还有补丁数据未添加，是否直接关闭补丁窗口？
1573 = 补丁数据未添加
1574 = 当选择“保存当前上下文并在返回时修改”时，仅能选用“修改寄存器指向内存”补丁类型！
1575 = EXE文件(*.exe)\0*.exe\0
1576 = DLL文件(*.*)\0*.*\0

; ListCombo
1600 = 修改寄存器
1601 = 修改标志寄存器
1602 = 修改寄存器指向的内存
1603 = 修改 EIP/RIP
1604 = 内存注册机
1605 = 存储当前数据
1606 = 修改存储地址指向的内存
1607 = 添加反调试检测
1608 = 修改MMX数值

1610 = 自定义立即数
1611 = 当前寄存器
1612 = 寄存器指向的内存
1613 = 使用存储数据

1620 = 添加连接符
1621 = 添加寄存器数值
1622 = 添加寄存器指向内存
1623 = 使用存储数据
1624 = 弹窗展示记录信息

1630 = 保存寄存器
1631 = 保存寄存器指向内存
1632 = 存储汇编指令中的地址

1640 = 寄存器
1641 = 寄存器指向内存

1650 = 等于
1651 = 不等

1660 = 等于
1661 = 不等
1662 = 大于
1663 = 大于等于
1664 = 小于
1665 = 小于等于
1666 = 有符号大于
1667 = 有符号大于等于
1668 = 有符号小于
1669 = 有符号小于等于

1670 = BYTE
1671 = WORD
1672 = DWORD
1673 = HEX 数值
1674 = ASCII 字符串
1675 = Delphi字符串
1676 = Unicode字符串
1677 = ASCII 长度
1678 = Delphi长度
1679 = Unicode长度
1680 = QWORD

1690 = BYTE
1691 = WORD
1692 = DWORD
1693 = HEX 数值
1694 = ASCII 字符串
1695 = Delphi字符串
1696 = Unicode字符串
1697 = QWORD

1700 = BYTE
1701 = BYTE(十进制)
1702 = WORD
1703 = WORD(十进制)
1704 = DWORD
1705 = DWORD(十进制)
1706 = DWORD(有符号)
1707 = QWORD
1708 = QWORD(十进制)
1709 = QWORD(有符号)

1710 = BYTE
1711 = BYTE(十进制)
1712 = WORD
1713 = WORD(十进制)
1714 = DWORD
1715 = DWORD(十进制)
1716 = DWORD(有符号)
1717 = HEX 数值
1718 = ASCII字符串
1719 = Delhpi字符串
1720 = Unicode字符串
1721 = QWORD
1722 = QWORD(十进制)
1723 = QWORD(有符号)

1730 = 不参与运算
1731 = 与运算(AND)
1732 = 或运算(OR)
1733 = 异或运算(XOR)
1734 = 取反运算(NOT)
1735 = 逻辑左移(SHL)
1736 = 循环左移(ROL)
1737 = 逻辑右移(SHR)
1738 = 循环右移(ROR)
1739 = 算术右移(SAR)
1740 = 加法(ADD)
1741 = 减法(SUB)
1742 = 乘法(MUL)
1743 = 除法(DIV)
1744 = 求余(MOD)

1750 = 一次
1751 = 每次

1760 = 智能断点
1761 = INT3断点
1762 = 硬件断点

1770 = 保存当前上下文并在返回时修改
1771 = 函数返回时修改上下文
1772 = 函数直接返回后修改上下文

; PE Check
2000 = 文件不存在或加载失败
2001 = 这不是一个有效的PE文件
2002 = 这不是一个有效的32bit PE文件
2003 = 这不是一个有效的32bit Dll文件
2004 = 这不是一个有效的32bit EXE文件
2005 = 这不是一个有效的64bit PE文件
2006 = 这不是一个有效的64bit Dll文件
2007 = 这不是一个有效的64bit EXE文件


[ComparePeUi]
; PlugIn Name
666 = PE文件二进制比较

; MainUI
1000 = PE文件二进制比较
1001 = 原始文件：
1002 = 修改文件：
1003 = 重置基地址(HEX)：
1004 = 全选
1005 = 找到 0 处不同，共 0 个字节。
1006 = 添加选中
1007 = 比较文件

1010 = 相对偏移(RVA)：
1011 = 虚拟地址(VA)：
1012 = 文件偏移(FVA)：
1013 = 原始数据：
1014 = 修改数据：
1015 = 条目信息

1020 = 相对偏移(RVA)
1021 = 虚拟地址(VA)
1022 = 文件偏移(FOA)
1023 = 原始数据
1024 = 修改数据
1025 = 区段信息

1030 = 比较文件自动添加
1031 = 原始文件打开失败！
1032 = 修改文件打开失败！
1033 = 文件比较失败，未知错误！
1034 = 原始文件和修改文件类型不同，不做对比！
1035 = 原始文件和修改文件大小不同，不做对比！
1036 = 基地址数据输入有误，请检查后重新比对！
1037 = 基地址数据输入有误，超过PE文件最大值！
1038 = 原始文件与工程文件不一致，不进行添加。
1039 = 请先进行比对后再进行添加。
1040 = 共找到 %d 处不同，共 %d 个字节。
1041 = EXE文件(*.exe)\0*.exe\0DLL文件(*.dll)\0*.dll\0PE文件(*.*)\0*.*\0

; PE Check
2000 = 文件不存在或加载失败
2001 = 这不是一个有效的PE文件
2002 = 这不是一个有效的32bit PE文件
2003 = 这不是一个有效的32bit Dll文件
2004 = 这不是一个有效的32bit EXE文件
2005 = 这不是一个有效的64bit PE文件
2006 = 这不是一个有效的64bit Dll文件
2007 = 这不是一个有效的64bit EXE文件

[OffsetTransformUi]
; PlugIn Name
666 = 地址格式转换

; MainUI
1000 = 地址格式转换
1001 = 目标文件：
1002 = 区段信息
1003 = 格式转换
1004 = 类型：
1005 = 基址：
1006 = 转换
1007 = 文件大小：
1008 = 镜像大小：

1010 = 相对偏移(RVA)
1011 = 虚拟地址(VA)
1012 = 文件偏移(FOA)
1013 = 原始数据
1014 = 区段信息

1020 = 区段信息
1021 = 虚拟地址(VA)
1022 = 虚拟大小
1023 = 文件偏移(FOA)
1024 = 数据大小
1025 = 区段属性

1030 = 输入的 %s 数值有误，请检查后重新输入！
1031 = 相对偏移(RVA)输入有误，已超出模块视图！
1032 = 虚拟地址(VA)输入有误，应大于等于基址并小于模块视图上限！
1033 = 文件偏移(FOA)输入有误，已超出文件大小！
1034 = 文件偏移(FOA)超出文件大小，没有位于文件中！
1035 = 基地址(HEX)数据输入有误，超过PE文件最大值！
1036 = 基地址(HEX)数据输入有误，请检查后重新输入！
1037 = 原始文件打开失败！
1038 = EXE文件(*.exe)\0*.exe\0DLL文件(*.dll)\0*.dll\0PE文件(*.*)\0*.*\0

; PE Check
2000 = 文件不存在或加载失败
2001 = 这不是一个有效的PE文件
2002 = 这不是一个有效的32bit PE文件
2003 = 这不是一个有效的32bit Dll文件
2004 = 这不是一个有效的32bit EXE文件
2005 = 这不是一个有效的64bit PE文件
2006 = 这不是一个有效的64bit Dll文件
2007 = 这不是一个有效的64bit EXE文件


[SearchFeatureUi]
; PlugIn Name
666 = 特征码搜索

; MainUI
1000 = 特征码搜索
1001 = 目标文件：
1002 = 特征码：
1003 = 重置基地址(HEX):
1004 = 共找到 0 处。
1005 = 搜索
1006 = 搜索字符串

1010 = 序号
1011 = 虚拟地址(VA)
1012 = 相对偏移(RVA)
1013 = 文件偏移(FOA)
1014 = 区段信息
1015 = 区段属性

1020 = 未找到特征码。
1021 = 共找到 %d 处。
1022 = 至少找到 %d 处。
1023 = EXE文件(*.exe)\0*.exe\0DLL文件(*.dll)\0*.dll\0PE文件(*.*)\0*.*\0
1024 = 特征码数据必须为 HEX 数值（支持 ??）。
1025 = 特征码长度必须为偶数。
1026 = 特征码格式错误！\r\n格式为：AA BB ?? ?? CC
1027 = 目标文件为空，请先选择一个目标文件。
1028 = 目标文件打开失败！
1029 = 未找到特征码数据！
1030 = 基地址数据输入有误，超过PE文件最大值！
1031 = 基地址数据输入有误，有检查后重新比对！
1033 = 请输入特征码数据！

1040 = 复制 虚拟地址(VA) 成功！
1041 = 复制 虚拟地址(VA) 失败！
1042 = 复制 相对偏移(RVA) 成功！
1043 = 复制 相对偏移(RVA) 失败！
1044 = 复制 文件偏移(FOA) 成功！
1045 = 复制 文件偏移(FOA) 失败！

1050 = 复制 虚拟地址(VA)
1051 = 复制 相对偏移(RVA)
1052 = 复制 文件偏移(FOA)

; PE Check
2000 = 文件不存在或加载失败
2001 = 这不是一个有效的PE文件
2002 = 这不是一个有效的32bit PE文件
2003 = 这不是一个有效的32bit Dll文件
2004 = 这不是一个有效的32bit EXE文件
2005 = 这不是一个有效的64bit PE文件
2006 = 这不是一个有效的64bit Dll文件
2007 = 这不是一个有效的64bit EXE文件


[StringToHexUi]
; PlugIn Name
666 = 字符串转十六进制

; MainUI
1000 = 字符串转十六进制
1001 = 字符串数据：
1002 = 十六进制数据（按字符串顺序从左到右，大尾）：
1003 = 转化
1004 = 字符串转化失败，可能是数据太长了。


[PatchUi]
1000 = 程序名称：
1001 = 补丁作者：
1002 = 发布时间：
1003 = 执行补丁
1004 = 选择释放

1010 = 自定义释放文件
1011 = 序号
1012 = 模块名称
1013 = 类型
1014 = 劫持模块
1015 = 破解模块
1016 = 全选
1017 = 确定
1018 = 第三方模块
1019 = 关于

1020 = 注入失败！错误码：%d 。
1021 = 智能选择补丁超时，程序可能正运行或未找到可用的劫持DLL，是否启用注入模式？\r\n\r\n友情提示：若程序有壳，推荐手动释放全部文件后进行测试。\r\n
1022 = 文件创建失败！有进程正在占用，请先关闭该进程再进行补丁。\r\n文件路径：%s
1023 = 文件创建失败！错误码：%d \r\n文件路径：%s
1024 = 写入文件失败！错误码：%d \r\n文件路径：%s
1025 = 补丁成功！
1026 = 文件释放失败！
1027 = %d 个文件释放成功！
1028 = 该文件已经存在，是否覆盖？\r\n目标文件：%s



